In [3]:
lis=[]
n=input("enter the number of data:")
for i in range(int(n)):
    d={}
    d["name"]=input("enter the name:")
    d["mark1"]=input("enter mark1:")
    d["mark2"]=input("enter mark2:")
    d["mark3"]=input("enter mark3:")
    lis.append(d)
print(lis)

enter the number of data3
enter the namesfs
enter mark110
enter mark220
enter mark330
enter the namedfvd
enter mark140
enter mark250
enter mark360
enter the namegt
enter mark170
enter mark280
enter mark390
[{'name': 'sfs', 'mark1': '10', 'mark2': '20', 'mark3': '30'}, {'name': 'dfvd', 'mark1': '40', 'mark2': '50', 'mark3': '60'}, {'name': 'gt', 'mark1': '70', 'mark2': '80', 'mark3': '90'}]

In [4]:
import pandas as pd

In [5]:
df=pd.Series(data=lis)
df

0    {'name': 'sfs', 'mark1': '10', 'mark2': '20', ...
1    {'name': 'dfvd', 'mark1': '40', 'mark2': '50',...
2    {'name': 'gt', 'mark1': '70', 'mark2': '80', '...
dtype: object

In [6]:
type(df)

pandas.core.series.Series

In [7]:
name=["jigar","nikunj","asad"]
mark=[50,45,40]
a=pd.Series(data=name)
a

0     jigar
1    nikunj
2      asad
dtype: object

In [8]:
type(a)

pandas.core.series.Series

In [9]:
b=pd.Series(data=mark)
b

0    50
1    45
2    40
dtype: int64

In [10]:
type(b)

pandas.core.series.Series

In [11]:
student={"name":name,"mark":mark}
student

{'name': ['jigar', 'nikunj', 'asad'], 'mark': [50, 45, 40]}

In [12]:
type(student)

dict

In [13]:
c=pd.DataFrame(data=student,index=["a","b","c"])
c

     name  mark
a   jigar    50
b  nikunj    45
c    asad    40

In [14]:
d=pd.DataFrame(data=student)
d

     name  mark
0   jigar    50
1  nikunj    45
2    asad    40

In [15]:
d.shape

(3, 2)

In [16]:
d.info

<bound method DataFrame.info of      name  mark
0   jigar    50
1  nikunj    45
2    asad    40>

In [17]:
d.describe

<bound method NDFrame.describe of      name  mark
0   jigar    50
1  nikunj    45
2    asad    40>

In [18]:
#defult head give top 5 records
d.head()

     name  mark
0   jigar    50
1  nikunj    45
2    asad    40

In [19]:
d.head(2)

     name  mark
0   jigar    50
1  nikunj    45

In [20]:
d.tail(2)

     name  mark
1  nikunj    45
2    asad    40

In [27]:
e=pd.read_csv("student.csv")
e

      Name  Age  Marks
0    Jigar   23     91
1   Nikunj   22     89
2  Dhrumit   21     95
3    Samir   22     91
4     Asad   23     90
5    Parth   23     85
6    Dhruv   23     75
7   Saloni   22     80
8    Mahek   23     85
9     Yash   22     70

In [28]:
type(e)

pandas.core.frame.DataFrame

In [29]:
e.head(5)

      Name  Age  Marks
0    Jigar   23     91
1   Nikunj   22     89
2  Dhrumit   21     95
3    Samir   22     91
4     Asad   23     90

In [30]:
e.tail(5)

     Name  Age  Marks
5   Parth   23     85
6   Dhruv   23     75
7  Saloni   22     80
8   Mahek   23     85
9    Yash   22     70

In [33]:
#using index e.iloc[row_index,column_index]
e.iloc[2]

Name     Dhrumit
Age           21
Marks         95
Name: 2, dtype: object

In [34]:
e.iloc[2,1]

21

In [35]:
e.columns

Index(['Name', 'Age', 'Marks'], dtype='object')

In [37]:
e["Name"]

0      Jigar
1     Nikunj
2    Dhrumit
3      Samir
4       Asad
5      Parth
6      Dhruv
7     Saloni
8      Mahek
9       Yash
Name: Name, dtype: object

In [38]:
e.iloc[:,1]

0    23
1    22
2    21
3    22
4    23
5    23
6    23
7    22
8    23
9    22
Name: Age, dtype: int64

In [39]:
e.iloc[:,0]

0      Jigar
1     Nikunj
2    Dhrumit
3      Samir
4       Asad
5      Parth
6      Dhruv
7     Saloni
8      Mahek
9       Yash
Name: Name, dtype: object

In [40]:
e.info

<bound method DataFrame.info of       Name  Age  Marks
0    Jigar   23     91
1   Nikunj   22     89
2  Dhrumit   21     95
3    Samir   22     91
4     Asad   23     90
5    Parth   23     85
6    Dhruv   23     75
7   Saloni   22     80
8    Mahek   23     85
9     Yash   22     70>

In [41]:
e.describe

<bound method NDFrame.describe of       Name  Age  Marks
0    Jigar   23     91
1   Nikunj   22     89
2  Dhrumit   21     95
3    Samir   22     91
4     Asad   23     90
5    Parth   23     85
6    Dhruv   23     75
7   Saloni   22     80
8    Mahek   23     85
9     Yash   22     70>

In [43]:
e.iloc[:,:2]

      Name  Age
0    Jigar   23
1   Nikunj   22
2  Dhrumit   21
3    Samir   22
4     Asad   23
5    Parth   23
6    Dhruv   23
7   Saloni   22
8    Mahek   23
9     Yash   22

In [44]:
e[["Name","Marks"]]

      Name  Marks
0    Jigar     91
1   Nikunj     89
2  Dhrumit     95
3    Samir     91
4     Asad     90
5    Parth     85
6    Dhruv     75
7   Saloni     80
8    Mahek     85
9     Yash     70

In [45]:
e.iloc[4:10]

     Name  Age  Marks
4    Asad   23     90
5   Parth   23     85
6   Dhruv   23     75
7  Saloni   22     80
8   Mahek   23     85
9    Yash   22     70

In [46]:
e.head(3)

      Name  Age  Marks
0    Jigar   23     91
1   Nikunj   22     89
2  Dhrumit   21     95

In [47]:
e.tail(3)

     Name  Age  Marks
7  Saloni   22     80
8   Mahek   23     85
9    Yash   22     70

In [51]:
d["mark2"]=[70,80,90]
d

     name  mark  mark2
0   jigar    50     70
1  nikunj    45     80
2    asad    40     90

In [52]:
d["Total"]=d["mark"]+d["mark2"]
d

     name  mark  mark2  Total
0   jigar    50     70    120
1  nikunj    45     80    125
2    asad    40     90    130

In [51]:
import pandas as pd

In [52]:
e=pd.read_csv("student.csv")
e

      Name  Age  Marks
0    Jigar   23     91
1   Nikunj   22     89
2  Dhrumit   21     95
3    Samir   22     91
4     Asad   23     90
5    Parth   23     85
6    Dhruv   23     75
7   Saloni   22     80
8    Mahek   23     85
9     Yash   22     70

In [53]:
f=e.rename(columns={"Marks":"Marks1"})
f

      Name  Age  Marks1
0    Jigar   23      91
1   Nikunj   22      89
2  Dhrumit   21      95
3    Samir   22      91
4     Asad   23      90
5    Parth   23      85
6    Dhruv   23      75
7   Saloni   22      80
8    Mahek   23      85
9     Yash   22      70